app/controllers/sessions_controller.rb

  def  create
     user_params = params.require(:user)
     @user = User.where(username: user_params[:username]).or(User.where(email: user_params[:username])).first
---
SELECT  `users`.* FROM `users` WHERE (`users`.`username` = 'akendy' OR `users`.`email` = 'akendy') ORDER BY `users`.`id` ASC LIMIT 1