app/controllers/users_controller.rb

    def create
        user_params = params.require(:user).permit(:username, :email, :password, :password_confirmation)
        @user = User.new(user_params)
        @user.recover_password = nil

        if @user.valid?
            @user.save
---
INSERT INTO `users` (`username`, `email`, `confirmation_token`, `password_digest`, `created_at`, `updated_at`, `recover_password`) VALUES ('Jean2', 'jkenel_26@hotmail.com', 'aadNsAQgFkPW8qLfMinxEAtE', '$2a$10$CYZObL9CfICCuAHGz9pcguxkNhramGdCSSqOwwpS5ph9VRdFme9dK', '2019-04-11 23:03:52', '2019-04-11 23:03:52', 'BE8W9ASpgsC3hGWBZGMPoAhf')

    def confirm
        @user = User.find(params[:id])
        if @user.confirmation_token == params[:token]
            @user.update_attributes(confirmed: true, confirmation_token: nil)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 8 LIMIT 1
UPDATE `users` SET `confirmation_token` = NULL, `confirmed` = TRUE, `updated_at` = '2019-03-24 14:01:42' WHERE `users`.`id` = 8

    def update
        @user = current_user
        user_params = params.require(:user).permit(:username, :firstname, :lastname, :avatar_file, :email)
        puts user_params[:avatar].inspect
        if @user.update(user_params)
---
UPDATE `users` SET `firstname` = '', `lastname` = '', `avatar` = TRUE, `updated_at` = '2019-04-11 23:04:40' WHERE `users`.`id` = 17